DataProcessors/ЗагрузитьОИСП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузитьОИСП</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяШаблона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/ОтделыОСП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ОтделыОСП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НазваниеОСП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОСП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТерритории</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРегиона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Факс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РайонОбслуживания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗагрузитьОИСП/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбФайла.Заголовок				= "Выберите файл для загрузки:";
	ДиалогВыбФайла.ПолноеИмяФайла			= Объект.ИмяФайла; //АДРЕС
	ДиалогВыбФайла.Фильтр					= "Excel (*.xlsx)|*.xls*";
	ДиалогВыбФайла.Расширение				= "xlsx";
	ДиалогВыбФайла.МножественныйВыбор		= Ложь;
	ДиалогВыбФайла.ПредварительныйПросмотр	= Ложь;
	ДиалогВыбФайла.Показать(Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма));
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДопПарметры) Экспорт
	Если ЗначениеЗаполнено(ВыбранныеФайлы) и ВыбранныеФайлы.Количество() > 0 Тогда
		 Объект.ИмяФайла = ВыбранныеФайлы[0];
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	
	    // запишу врем файл и передам его  обработчику
	  
     	   Shell = Новый COMОбъект("WScript.Shell");
           дирМоиД=Shell.SpecialFolders.Item("MyDocuments");
		   
		   
		    имяфайлатемп=дирМоиД+"\темпОисп.txt";
			   
		    имяфайлатемпответ=дирМоиД+"\темпОисп_out.txt";

		    программаОбр=дирМоиД+"\ExcelParse.exe";

			
	        ФайлТемп = Новый ЗаписьТекста(имяфайлатемп);

			
			
			ФайлТемп.ЗаписатьСтроку(ОТДЕЛ_ОСП);
			ФайлТемп.ЗаписатьСтроку(АдресОтдела);
			
			
			
           ФайлТемп.ЗаписатьСтроку(Объект.ИмяФайла);
		   
		   ФайлТемп.Закрыть();

		   
		   
		   	
			 программаОбр=программаОбр+" "+"12";
			 
			 
			 Shell.Run(программаОбр,0, 1);
			 
			 
			 
    			 мСтрокФайла = Новый Массив();

			   ВыбранныйФайл = Новый Файл(имяфайлатемпответ);
			   Если ВыбранныйФайл.Существует() Тогда

				   	ПрочитанныйТекст = Новый ЧтениеТекста(имяфайлатемпответ, КодировкаТекста.UTF8);

					Строка = ПрочитанныйТекст.ПрочитатьСтроку();
					
					 Если Строка <> Неопределено Тогда

						 
						 мСтрокФайла.Добавить(Строка);
						 
					 КонецЕсли;
					 
					 
					 
					Пока Строка <> Неопределено Цикл
                       Строка = ПрочитанныйТекст.ПрочитатьСтроку();
					   Если Строка <> Неопределено Тогда
						      Если Строка<>""  Тогда
						 
						 	   мСтрокФайла.Добавить(Строка);
						 
						    КонецЕсли; 
						 
						   
					        
					     КонецЕсли;
					КонецЦикла;
 
				   
				   
				   
			   КонецЕсли;

			
			   
			    Для каждого стрд  Из мСтрокФайла Цикл
				  
				     должДанныет=РазбитьСтроку(стрд);
				   
				   	Запись=ТЧ.Добавить();
				    	 
					
						
						Запись.ОтделОсп=должДанныет["ОТДЕЛ_ОСП"]; 	
						Запись.АдресОсп=должДанныет["Адрес_отдела"]; 
					 
									  
				  
			  КонецЦикла;
 
	
КонецПроцедуры



&НаКлиенте
Функция РазбитьСтроку(стрк)

  	     должДанные=Новый Структура;

	
	Разделитель = ":";
    Строки = СтрЗаменить(стрк, Разделитель, Символы.ПС);
    Для Индекс = 1 По СтрЧислоСтрок(Строки) Цикл
				
		  Если Индекс = 1 Тогда
		  
		  	     должДанные.Вставить("ОТДЕЛ_ОСП",СтрПолучитьСтроку(Строки, Индекс));

		  
		  КонецЕсли;
		  
		  Если Индекс = 2 Тогда
		  
		  	     должДанные.Вставить("Адрес_отдела",СтрПолучитьСтроку(Строки, Индекс));

		  
		  КонецЕсли;
		  
		
		
    КонецЦикла;
	
	
	
	Возврат должДанные; 
	
КонецФункции // ()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОТДЕЛ_ОСП="ОТДЕЛ ОСП";
	АдресОтдела="Адрес отдела";
	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	Для каждого стр Из ТЧ  Цикл
		
									
					Запрос = Новый Запрос;
					Запрос.Текст = 
						"ВЫБРАТЬ
						|	ОтделыОСП.Ссылка КАК Ссылка
						|ИЗ
						|	Справочник.ОтделыОСП КАК ОтделыОСП
						|ГДЕ
						|	ОтделыОСП.НазваниеОСП ПОДОБНО &НазваниеОСП";
					
					Запрос.УстановитьПараметр("НазваниеОСП","%"+ стр.ОтделОсп+"%");
					
					РезультатЗапроса = Запрос.Выполнить();
					
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Если ВыборкаДетальныеЗаписи.Количество()=0 Тогда
						
						записьСпр=Справочники.ОтделыОСП.СоздатьЭлемент();
						записьСпр.НазваниеОСП=стр.ОтделОсп;
						записьСпр.Наименование=стр.ОтделОсп;
						записьСпр.АдресОСП=стр.АдресОсп;
						записьСпр.КодТерритории=стр.КодТерритории;
						записьСпр.КодРегиона=стр.КодРегиона;
						записьСпр.Руководитель=стр.Руководитель;
						записьСпр.Телефон1=стр.Телефон1;
						записьСпр.Телефон2=стр.Телефон2;
						записьСпр.Телефон3=стр.Телефон3;
						записьСпр.Факс=стр.Факс;
						
						записьСпр.РайонОбслуживания=стр.РайонОбслуживания;
						записьСпр.Записать();
						
					Иначе	
						
						ВыборкаДетальныеЗаписи.Следующий();
						
						об=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
						
						об.НазваниеОСП=стр.ОтделОсп;
						об.Наименование=стр.ОтделОсп;
						об.АдресОСП=стр.АдресОсп;
						об.КодТерритории=стр.КодТерритории;
						об.КодРегиона=стр.КодРегиона;
						об.Руководитель=стр.Руководитель;
						об.Телефон1=стр.Телефон1;
						об.Телефон2=стр.Телефон2;
						об.Телефон3=стр.Телефон3;
						об.Факс=стр.Факс;
						
						об.РайонОбслуживания=стр.РайонОбслуживания;
						об.Записать();

						
						
					
					КонецЕсли;
					
				
				
		
		
	
	КонецЦикла;
	
	
	
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
	
	Сообщить("Ок");
КонецПроцедуры

&НаКлиенте
Процедура Загрузить2(Команда)
	
	
	Файл = Новый Файл(Объект.ИмяФайла);
	Если НЕ Файл.Существует() Тогда
		Возврат;
	КонецЕсли;
	ДвоичныеДанные = Новый ДвоичныеДанные(Объект.ИмяФайла);

	ОбработатьНаСервере(ДвоичныеДанные, Файл.Расширение);	 
	
	
	
	
КонецПроцедуры


&НаСервере
Процедура ОбработатьНаСервере(ДвоичныеДанные, Расширение)
	
	  //ТЗОбработа.Очистить();
	
	   ФайлEXCELНаСервере = ПолучитьИмяВременногоФайла(Расширение);
	   ДвоичныеДанные.Записать(ФайлEXCELНаСервере);
	 	    
	   ФайлЕксел.Прочитать(ФайлEXCELНаСервере,СпособЧтенияЗначенийТабличногоДокумента.Текст);
	   УдалитьФайлы(ФайлEXCELНаСервере);
	
	  
		
       ПЗ = Новый ПостроительЗапроса;

	   ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ФайлЕксел.Область());

	   ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;

	   ПЗ.ЗаполнитьНастройки();

	   ПЗ.Выполнить();

	   ТаблицаЗначений = ПЗ.Результат.Выгрузить();
	   
	     Для каждого стр Из ТаблицаЗначений Цикл

			 //код региона          = стр.КодРегиона
			 
			 //code of the territorial agency    = стр.CodeOfTheTerritorialAgency
			 
			 //Наименование отдела    = стр.НаименованиеОтдела
			 
			 //почтовый адрес   = стр.ПочтовыйАдрес
			 
			 //руководитель  = стр.Руководитель
			 
			 //телефон1   = стр.Телефон1
			 
			 //факс    = стр.Факс
			 
			 //телефон2   = 
			 
			 //телефон3
			 
			 //район обслуживания     = стр.РайонОбслуживания
			 
			 
			 новаяСтрока=ТЧ.Добавить();
			 
			 
			 новаяСтрока.ОтделОсп=стр.НаименованиеОтдела;
			 новаяСтрока.АдресОсп=стр.ПочтовыйАдрес;
			 новаяСтрока.КодТерритории=стр.CodeOfTheTerritorialAgency;
			 новаяСтрока.КодРегиона=стр.КодРегиона;
			 новаяСтрока.Руководитель=стр.Руководитель;
			 новаяСтрока.Телефон1=стр.Телефон1;
			 новаяСтрока.Факс=стр.Факс;
			 новаяСтрока.Телефон2=стр.Телефон2;
			 новаяСтрока.Телефон3=стр.Телефон3;
			 
			 новаяСтрока.РайонОбслуживания=стр.РайонОбслуживания;
			 
			 
			 
		 КонецЦикла;
 	 

	
	
	
	
КонецПроцедуры
